Revit 2026 API

# ReferencePlaneBubbleEnd Property

---

The bubble end of the reference plane.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ BubbleEnd { get; set; }
```
```vb
Public Property BubbleEnd As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ BubbleEnd {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member BubbleEnd : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

When setting this property, an exception will be thrown if the bubble end is set to almost the same point as free end or if the vector from BubbleEnd -> FreeEnd is not perpendicular to the normal vector.

#### Reference

ReferencePlane Class

Autodesk.Revit.DB Namespace